{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React component switching between landing and player views based on persisted video URL state.",
  "frontend/src/components/EmbedFallback.tsx": "Component that renders iframe embeds when available or shows a fallback alert with a link to open externally.",
  "frontend/src/components/LandingHero.tsx": "Hero landing section with branding, descriptive text, and the video URL input form.",
  "frontend/src/components/LayoutShell.tsx": "Page layout wrapper providing header, main content area, and footer styling.",
  "frontend/src/components/PlayerView.tsx": "Video player page with editing controls, share-link copy actions, and video rendering.",
  "frontend/src/components/VideoLinkForm.tsx": "URL input form with validation, error handling, and submit button for loading a video.",
  "frontend/src/components/VideoRenderer.tsx": "Determines whether to render an HTML5 video player or an embed fallback based on URL type.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user's identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading using DFINITY AuthClient.",
  "frontend/src/hooks/useShareVideoUrl.ts": "Manages a shareable video URL via state and syncs it with the browser query parameter.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm color theme with light and dark mode variables.",
  "frontend/src/lib/clipboard.ts": "Copies text to the clipboard using the native API with a fallback for older browsers.",
  "frontend/src/lib/validation.ts": "Validates and normalizes video URLs, enforcing protocol rules and attempting protocol autocompletion.",
  "frontend/src/lib/videoUrl.ts": "Detects video link type and generates embed URLs for common platforms like YouTube, Vimeo, and Twitch.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, themes, and plugins for typography and animations.",
  "project_state.json": "Describes the project state, features, and requirements for a website that plays shared video links."
}